# 1. What is machine learning in 1 sentence?

# Решаване на задачи без изрично да задаваме алгоритъма, по който да се решат, 
# а чрез автоматично откриване на модели в данни.


# 2. What is deep learning in 1 sentence?

# Машинно самообучение, при което автоматично се извличат нужните
# характеристики/признаци от вече налични такива.


# 3. What does model training mean in 1 sentence?

# Използване на обучаващо множество от данни, върху което моделът прави предположения, след
# което се измерва грешката с истинските стойности и се правят нужните корекции за намаляване
# на тази грешка. 


# 4. What task do Large Language Models solve?

# Предсказват следващ токен (част от дума, дума...) чрез избиране на този с най-голяма вероятност
# на база на предходно срещнатите думи (контекста).


# 5. What is the difference between loss functions and metrics?

# Loss functions се използват в процеса на обучение на модела. Metrics може да представлява 
# най-различни типове мерки за различни неща, които искаме да разберем. Например за 
# точност на модел и тн. Дават числа, които позволяват да интерпретираме крайния резултат.


# 6. Why is the use of mean squared error preferred to the use of mean absolute error?

# Производната се смята по-лесно, както и съществува навсякъде (|a| при a=0 
# не е дефинирана производна).


# 7. Why can't we cube the difference to get the mean error instead of squaring it?

# Защото при квадратът премахваме знакът на разликата (нямаме отрицателни стойности). 
# При кубичните функции знакът се запазва. Също така няма долна граница, тоест 
# не можем да намерим минимум, защото той клони към безкрайност. 


# 8. Why is the derivative of the loss function beneficial during model training?

# Частните производни на функцията на загубата спрямо теглата директно определят
# градиенти, които използваме при обучението на модела - тоест на абстрактно
# ниво все едно определяме как да повлияем теглата, така че да си минимизираме грешката. 